<?php 

$arr = array(1, 2, 3, 6, 6, 6, 6, 6, 2, 2, 11, 12, 13, 14, 15, 2, 2, 2);

$key = 0;
$k = 4; // последовательность из k элементов
$x = 6; // равных числу х.
$counter = 0;
$mess = 'Последовательности из '.$k.' элементов равных числу '.$x.' НЕТ';

while ($arr[$key] || $arr[$key] === 0 || $arr[$key] === false) {
	if ($arr[$key] == $x) {
		$counter++;
		
		if ($counter == $k) {
			$mess = 'Последовательность из '.$k.' элементов равных числу '.$x.' НАЙДЕНА';
			break;
		}
		$key++;
		continue;
	}
	$counter = 0;
	$key++;
}

echo $mess;